/*------------------------------------------------

功能：编写函数,完成在一维数组(假设10个元素)中，查找任意整数x是否出现，
      若出现，返回第一次出现的下标，否则返回-1。
例如：
输入：1 5 3 7 4 8 2 9 12 6
输入：8
输出：5

------------------------------------------------*/
#include <stdlib.h>
#include<stdio.h>

int search(int a[],int n,int x)

{ 
  /**********Program**********/
    int k=-1;
	for(int i=0;i<10;i++) {
		if(x==a[i]) k=i;
	}
	return k;
  /**********  End  **********/
}


int main()
{
int a[10],x,i,k;
for(i=0;i<10;i++)     
scanf("%d", a+i);     /*输入10个数*/
scanf("%d",&x);
k=search(a,10,x);
 printf("%d\n",k);
}

